In [ ]:
"""Q1. Write a code to print the data present in the second row of the dataframe, df."""

In [2]:
import pandas as pd
course_name = ['Data Science','Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [6]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
"""Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?"""

In [ ]:
"""loc is used to select data from a DataFrame based on the label of the rows and columns. 
iloc is used to select data from a DataFrame based on the integer position of the rows and columns."""

In [ ]:
"""Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2]."""

In [7]:
new_df=df.reindex([3,0,1,2])
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [8]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [9]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
"""yes there is difference in output loc uses column_name to find the row whwere as iloc uses index irrespective to the column name"""

In [ ]:
"""Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’"""

In [10]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [11]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.442633  0.250143  0.465932  0.980325  0.434936  0.284089
2  0.973069  0.226187  0.819428  0.879736  0.812863  0.258546
3  0.332170  0.050186  0.892743  0.805953  0.458021  0.623594
4  0.703967  0.774630  0.017857  0.901535  0.045439  0.364682
5  0.975849  0.675591  0.059043  0.947651  0.881842  0.696466
6  0.865579  0.983040  0.870775  0.588522  0.895770  0.151262

In [12]:
df1.mean()

column_1    0.715544
column_2    0.493296
column_3    0.520963
column_4    0.850620
column_5    0.588145
column_6    0.396440
dtype: float64

In [14]:
df1['column_1'].std()

0.2750195665472015

In [ ]:
"""Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why."""

In [22]:
df1.loc[1, 'column_2'] = "0.250143"
df1.loc[2, 'column_2'] = "0.696466"

In [24]:
df1['column_1'].mean()

0.7155443368697024

In [ ]:
"""Q6. What do you understand about the windows function in pandas and list the types of windows
functions?"""

In [ ]:
""" a window function (also known as rolling or moving functions) is a way to apply a function to a rolling window of data in a DataFrame. 
The window function can be applied to a specified window size, which rolls over the data frame row by row or column by column, performing a 
calculation on the current window of data.
rolling().mean(): calculates the moving average of a rolling window of data.
rolling().sum(): calculates the moving sum of a rolling window of data.
rolling().std(): calculates the moving standard deviation of a rolling window of data.
rolling().min(): calculates the moving minimum of a rolling window of data.
rolling().max(): calculates the moving maximum of a rolling window of data.
rolling().median(): calculates the moving median of a rolling window of data."""

In [ ]:
"""Q7. Write a code to print only the current month and year at the time of answering this question."""

In [25]:
import pandas as pd
from datetime import datetime
current_datetime = datetime.now()
current_timestamp = pd.Timestamp(current_datetime)
current_year = current_timestamp.year
current_month = current_timestamp.month
print("Current Year:", current_year)
print("Current Month:", current_month)

Current Year: 2023
Current Month: 2

In [ ]:
"""Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result."""

In [26]:
import pandas as pd

date1 = "2023-01-23"

date2 = "2023-02-23"

date1 = pd.to_datetime(date1)
date2 = pd.to_datetime(date2)

delta = date2 - date1

days = delta.days
hours = delta.seconds // 3600
minutes = (delta.seconds // 60) % 60

print(f"The difference between {date1.date()} and {date2.date()} is {days} days, {hours} hours, and {minutes} minutes.")

The difference between 2023-01-23 and 2023-02-23 is 31 days, 0 hours, and 0 minutes.

In [ ]:
"""Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data."""

In [1]:
import  pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
col_name = input("Enter the column name to convert: ")
pd.Categorical(df[col_name])

Enter the column name to convert:  Pclass

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [ ]:
"""Q10. Write a Python program that reads a CSV file containing sales data for different products and
visualizes the data using a stacked bar chart to show the sales of each product category over time. The
program should prompt the user to enter the file path and display the chart."""